nv-11/benchmark_results/pd-ex-databse/pd-16-nokv/20251129-134121-bench.log
[2025-11-29 13:41:21] Log file: /benchmark_results/pd-nokv/20251129-134121-bench.log
[2025-11-29 13:41:21] ==========================================
[2025-11-29 13:41:21] PD Benchmark Configuration
[2025-11-29 13:41:21] ==========================================
[2025-11-29 13:41:21] Model: /models/Qwen3-30B-A3B-Instruct-2507-FP8
[2025-11-29 13:41:21] Served Model Name: Qwen3-30B-A3B-Instruct-2507-FP8
[2025-11-29 13:41:21] Base URL: http://localhost:30802
[2025-11-29 13:41:21] Output Directory: /benchmark_results/pd-nokv
[2025-11-29 13:41:21] Case Name: pd-nokv
[2025-11-29 13:41:21] ------------------------------------------
[2025-11-29 13:41:21] Test Type: combined
[2025-11-29 13:41:21] Test Parameters:
[2025-11-29 13:41:21]   Number of Prompts: 160
[2025-11-29 13:41:21]   Request Rate: 128
[2025-11-29 13:41:21]   Decode Output Length: 10
[2025-11-29 13:41:21]   Input Lengths: 100 1000 10000 20000 50000
[2025-11-29 13:41:21]   Base Seed: 45
[2025-11-29 13:41:21] ------------------------------------------
[2025-11-29 13:41:21] Warmup: true
[2025-11-29 13:41:21]   Warmup Prompts: 5
[2025-11-29 13:41:21]   Warmup Input Length: 100
[2025-11-29 13:41:21]   Warmup Seed: 2
[2025-11-29 13:41:21] ==========================================
[2025-11-29 13:41:21] ==========================================
[2025-11-29 13:41:21] Running warmup...
[2025-11-29 13:41:21] ==========================================
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:41:24 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f659a3f02c0>, seed=2, num_prompts=5, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=1, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=['type=warmup'], result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:41:29 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [1, 1]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 52:10:51 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 5/5 [00:00<00:00, 12.57it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5         
Maximum request concurrency:             1         
Benchmark duration (s):                  0.40      
Total input tokens:                      500       
Total generated tokens:                  5         
Request throughput (req/s):              12.56     
Output token throughput (tok/s):         12.56     
Peak output token throughput (tok/s):    5.00      
Peak concurrent requests:                5.00      
Total Token throughput (tok/s):          1268.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          79.19     
Median TTFT (ms):                        37.61     
P99 TTFT (ms):                           239.42    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================
[2025-11-29 13:41:30] Warmup completed
[2025-11-29 13:41:31] ==========================================
[2025-11-29 13:41:31] Starting PD Combined Tests
[2025-11-29 13:41:31] ==========================================
[2025-11-29 13:41:31] IMPORTANT: Ensure the model is deployed in PD mode!
[2025-11-29 13:41:31] ==========================================
[2025-11-29 13:41:31] ------------------------------------------
[2025-11-29 13:41:31] Testing with input_len=100, seed=145
[2025-11-29 13:41:31] ------------------------------------------
[2025-11-29 13:41:31] ==========================================
[2025-11-29 13:41:31] Running PD Combined Test
[2025-11-29 13:41:31] Input Length: 100, Seed: 145
[2025-11-29 13:41:31] ==========================================
[2025-11-29 13:41:31] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:41:35 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb01d0102c0>, seed=145, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=100,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-nokv/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:41:39 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 36:41:38 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:02<00:00, 53.82it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  2.97      
Total input tokens:                      15907     
Total generated tokens:                  1600      
Request throughput (req/s):              53.82     
Output token throughput (tok/s):         538.19    
Peak output token throughput (tok/s):    1133.00   
Peak concurrent requests:                136.00    
Total Token throughput (tok/s):          5888.82   
---------------Time to First Token----------------
Mean TTFT (ms):                          130.90    
Median TTFT (ms):                        39.65     
P99 TTFT (ms):                           2026.66   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.75     
Median TPOT (ms):                        10.87     
P99 TPOT (ms):                           100.60    
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.75     
Median ITL (ms):                         10.22     
P99 ITL (ms):                            24.17     
==================================================
[2025-11-29 13:41:43] PD Combined test completed for input_len=100
[2025-11-29 13:41:45] Completed combined test for input_len=100
[2025-11-29 13:41:45] 
[2025-11-29 13:41:45] ------------------------------------------
[2025-11-29 13:41:45] Testing with input_len=1000, seed=1045
[2025-11-29 13:41:45] ------------------------------------------
[2025-11-29 13:41:45] ==========================================
[2025-11-29 13:41:45] Running PD Combined Test
[2025-11-29 13:41:45] Input Length: 1000, Seed: 1045
[2025-11-29 13:41:45] ==========================================
[2025-11-29 13:41:45] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:41:49 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f31ab0142c0>, seed=1045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=1000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-nokv/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:41:53 [datasets.py:507] Sampling input_len from [1000, 1000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 34:55:25 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:03<00:00, 47.37it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  3.38      
Total input tokens:                      159690    
Total generated tokens:                  1600      
Request throughput (req/s):              47.37     
Output token throughput (tok/s):         473.67    
Peak output token throughput (tok/s):    1313.00   
Peak concurrent requests:                156.00    
Total Token throughput (tok/s):          47748.93  
---------------Time to First Token----------------
Mean TTFT (ms):                          1723.58   
Median TTFT (ms):                        1932.69   
P99 TTFT (ms):                           2722.33   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          43.96     
Median TPOT (ms):                        15.86     
P99 TPOT (ms):                           270.62    
---------------Inter-token Latency----------------
Mean ITL (ms):                           43.96     
Median ITL (ms):                         14.36     
P99 ITL (ms):                            1874.97   
==================================================
[2025-11-29 13:41:58] PD Combined test completed for input_len=1000
[2025-11-29 13:42:00] Completed combined test for input_len=1000
[2025-11-29 13:42:00] 
[2025-11-29 13:42:00] ------------------------------------------
[2025-11-29 13:42:00] Testing with input_len=10000, seed=10045
[2025-11-29 13:42:00] ------------------------------------------
[2025-11-29 13:42:00] ==========================================
[2025-11-29 13:42:00] Running PD Combined Test
[2025-11-29 13:42:00] Input Length: 10000, Seed: 10045
[2025-11-29 13:42:00] ==========================================
[2025-11-29 13:42:00] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:42:04 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fc74651c400>, seed=10045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=10000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-nokv/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:42:08 [datasets.py:507] Sampling input_len from [10000, 10000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 97:11:45 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:08<00:00, 18.95it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  8.44      
Total input tokens:                      1599978   
Total generated tokens:                  1585      
Request throughput (req/s):              18.95     
Output token throughput (tok/s):         187.74    
Peak output token throughput (tok/s):    467.00    
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          189703.75 
---------------Time to First Token----------------
Mean TTFT (ms):                          3002.95   
Median TTFT (ms):                        2806.64   
P99 TTFT (ms):                           6710.08   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          238.58    
Median TPOT (ms):                        262.26    
P99 TPOT (ms):                           456.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           238.47    
Median ITL (ms):                         381.58    
P99 ITL (ms):                            513.25    
==================================================
[2025-11-29 13:42:26] PD Combined test completed for input_len=10000
[2025-11-29 13:42:28] Completed combined test for input_len=10000
[2025-11-29 13:42:28] 
[2025-11-29 13:42:28] ------------------------------------------
[2025-11-29 13:42:28] Testing with input_len=20000, seed=20045
[2025-11-29 13:42:28] ------------------------------------------
[2025-11-29 13:42:28] ==========================================
[2025-11-29 13:42:28] Running PD Combined Test
[2025-11-29 13:42:28] Input Length: 20000, Seed: 20045
[2025-11-29 13:42:28] ==========================================
[2025-11-29 13:42:28] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:42:31 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fd7df5f4400>, seed=20045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=20000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=20000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-nokv/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:42:35 [datasets.py:507] Sampling input_len from [20000, 20000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 519:44:44 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:25<00:00,  6.38it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  25.06     
Total input tokens:                      3200000   
Total generated tokens:                  1582      
Request throughput (req/s):              6.38      
Output token throughput (tok/s):         63.12     
Peak output token throughput (tok/s):    154.00    
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          127736.97 
---------------Time to First Token----------------
Mean TTFT (ms):                          9081.76   
Median TTFT (ms):                        8417.48   
P99 TTFT (ms):                           21917.89  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          456.70    
Median TPOT (ms):                        513.63    
P99 TPOT (ms):                           745.71    
---------------Inter-token Latency----------------
Mean ITL (ms):                           456.70    
Median ITL (ms):                         508.23    
P99 ITL (ms):                            992.52    
==================================================
[2025-11-29 13:43:21] PD Combined test completed for input_len=20000
[2025-11-29 13:43:23] Completed combined test for input_len=20000
[2025-11-29 13:43:23] 
[2025-11-29 13:43:23] ------------------------------------------
[2025-11-29 13:43:23] Testing with input_len=50000, seed=50045
[2025-11-29 13:43:23] ------------------------------------------
[2025-11-29 13:43:23] ==========================================
[2025-11-29 13:43:23] Running PD Combined Test
[2025-11-29 13:43:23] Input Length: 50000, Seed: 50045
[2025-11-29 13:43:23] ==========================================
[2025-11-29 13:43:23] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-29 13:43:25 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3b9fe782c0>, seed=50045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=50000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30802', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=50000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-nokv/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 11-29 13:43:29 [datasets.py:507] Sampling input_len from [50000, 50000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:05 elapsed, 1230:27:47 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [01:55<00:00,  1.39it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  115.20    
Total input tokens:                      8000000   
Total generated tokens:                  1534      
Request throughput (req/s):              1.39      
Output token throughput (tok/s):         13.32     
Peak output token throughput (tok/s):    56.00     
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          69459.09  
---------------Time to First Token----------------
Mean TTFT (ms):                          39550.90  
Median TTFT (ms):                        36247.70  
P99 TTFT (ms):                           100954.26 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          878.04    
Median TPOT (ms):                        802.76    
P99 TPOT (ms):                           1355.24   
---------------Inter-token Latency----------------
Mean ITL (ms):                           890.20    
Median ITL (ms):                         844.05    
P99 ITL (ms):                            2325.65   
==================================================
[2025-11-29 13:45:56] PD Combined test completed for input_len=50000
[2025-11-29 13:45:58] Completed combined test for input_len=50000
[2025-11-29 13:45:58] 
[2025-11-29 13:45:58] ==========================================
[2025-11-29 13:45:58] All PD Combined Tests Completed
[2025-11-29 13:45:58] ==========================================
[2025-11-29 13:45:58] ==========================================
[2025-11-29 13:45:58] Test Results Summary
[2025-11-29 13:45:58] ==========================================
[2025-11-29 13:45:58] Results saved to: /benchmark_results/pd-nokv/benchmark_result.json
[2025-11-29 13:45:58] Result file size: 208K
[2025-11-29 13:45:58] Total test cases: 0
0
[2025-11-29 13:45:58] ==========================================
[2025-11-29 13:45:58] Total execution time: 277 seconds
[2025-11-29 13:45:58] Test completed successfully!